/*===========================================================================+
|  System   : config                                                         |
|  Task     : config header file                                             |
|----------------------------------------------------------------------------|
|  compile  : CC' C2000 -                                                    |
|  Link     : CC' C2000 -                                                    |
|  Call     :                                                                |
|----------------------------------------------------------------------------|
|  Author   : Xiaqinghua                                                     |
|  Version  : V1.00                                                          |
|  Creation : 03/11/2003                                                     |
|  Revision :                                                                |
+===========================================================================*/
#ifndef     __CONFIGDF_H
#define     __CONFIGDF_H

typedef enum enMACHINE_CONF_CODE
{
//   CONFIG 0:       @40H (CODE:@80-0000)
	CO0_KROROBOT=0, 	// 0  0x0001 1: 韩国机械手               	15-03-24
	CO0_BMC, 			// 1  0x0002 1: BMC机 可使用储料加压     	07-7-27
	CO0_SERVOP, 		// 2  0x0004 1: 使用电脑PID              	09-0-24
	CO0_ADJZX, 		  	// 3  0x0008 1: 震雄调模方式。				05-7-4
	CO0_DHYD, 			// 4  0x0010 1: (*?)直压机。      			07-1-24        
	CO0_MSNAG, 			// 5  0x0020 1: 机械安全检知反逻辑  
	CO0_CMPW, 			// 6  0x0040 1: 开关模计时警报使用。      	04-4-29 
	CO0_FLWDOT,			// 7  0x0080 1: 调模位置比3位小数点
	CO0_SDRL, 			// 8  0x0100 1: 安全门检测反逻辑。        	05-07-04
	CO0_OFFM, 			// 9  0x0200 1: 不使用机械手信号翻转检测
	CO0_RSDL, 			// 10 0x0400 1: 後安全门检测反逻辑。      	05-07-04
	CO0_FSAD, 			// 11 0x0800 1: 手动调模进不检查安全门。  	16-01-04    
	CO0_EJTDLY,			// 12 0x1000 1: (*博纳)托模阀延迟开。
	CO0_EJTDOT, 	    // 13 0x2000 1: 震动托模动作前延迟.
	CO0_EJTB, 			// 14 0x4000 1: 关模时，亦开脱退阀。(关模起始段开脱退阀)
	CO0_ATSD, 		    // 15 0x8000 1: 自动安全门使用点动模式。  

//   CONFIG 1 :    @41H (CODE:@82-0000)
	CO1_CPSR=16,		// 0  0x0001 1: 射出监控失败开模完停机  
	CO1_CYLW, 			// 1  0x0002 1: 全程计时警报包含关安全门时间  	07-01-29 
	CO1_ECAT, 			// 2  0x0004 1: 使用EtherCat通讯控制			2019-09-12	zt
	CO1_INTM, 			// 3  0x0008 1: 射出时间可设到0.001S。          07-3-8
	CO1_INJF, 			// 4  0x0010 1: 射出快速阀，只在射出二打开;     07-3-8
	CO1_SAAL, 			// 5  0x0020 1: 快速注射
	CO1_MCNS, 			// 6  0x0040 1: 手动储料不做射退。              03/03/25
	CO1_CHGE, 			// 7  0x0080 1: 开启托模电子尺滤波
	CO1_OPDC, 			// 8  0x0100 1: 储料时开模。                    05-9-22
	CO1_CLSH, 			// 9  0x0200 1: (*?)伺服系统转速输出按照模拟量线性输出   20160418     yxh
	CO1_LUBW, 			// 10 0x0400 1: 手动润滑输出警报。              05-4-27
	CO1_OPLT, 			// 11 0x0800 1: 开模一慢阀使用时间切    		05-6-14       
	CO1_OPLU, 			// 12 0x1000 1: 开模一慢阀使用差动阀      		05-6-14 
	CO1_SOEC, 			// 13 0x2000 1: 开模与脱模/中子同时动作。       04/9/15
	CO1_OIL, 			// 14 0x4000 1: 油温偏差开警报并切马达。        03/10/29
	CO1_EMERG, 			// 15 0x8000 1: 按下紧急开关键,不停止温度工作。 03/03/25

//   CONFIG 2:    @42H (CODE:@84-0000)
	CO2_ICURINJEND=32,	// 0  0x0001 1: 射出监控使用残料位置    		20161008 通用新加CODE
	CO2_EJTM, 			// 1  0x0002 1: 关模途中安全门            		16-03-14  znx				
	CO2_INJCLS, 		// 2  0x0004 1: 可用压塑动作。                  04-11-23
	CO2_ICUR, 			// 3  0x0008 1: 射出检控使用射出4固定位置       04-11-2
	CO2_OPNSM, 			// 4  0x0010 1: (*?)双马特殊开模动作。              04-12-14
	CO2_CSTP, 			// 5  0x0020 1: 自动状态时关模开安全门,关模动作停止。07-1-29 
	CO2_ULTL, 			// 6  0x0040 1: 差动阀开到高压止。            	06-12-29
	CO2_UPCV, 			// 7  0x0080 1: 半自动转全自动不需开关安全门    2015-7-20
	CO2_INCE, 			// 8  0x0100 1: 射出时，检查关模终。  
	CO2_MIDT, 			// 9  0x0200 1: 半自动时, 再次关模前使用再次循环计时。
	CO2_CLSLOW, 		// 10 0x0400 1: 关模低压阀使用选择开关。      	05-5-26
	CO2_INJCHG, 		// 11 0x0800 1:	射出时开储料背压阀功能
	CO2_HPEM, 			// 12 0x1000 1: 储料未定时完成,停在开模前。  04-6-6  
	CO2_CHGBK, 			// 13 0x2000 1: 使用储料背压比例。            	04-11-10 
	CO2_CHGX, 			// 14 0x4000 1:	自动清料使用单独压力流量   		20161009
	CO2_SAVC1, 			// 15 0x8000 1:	射出监控位置不采用偏差方式
	
//   CONFIG 3:   @43H (CODE:@86-0000)
	CO3_NFMI=48,		// 0  0x0001 1: 挡板部件使用，刚开机时请求数据，否则不请求，防止报警面板数据不全
	CO3_TBEM, 			// 1  0x0002 1: 手动座退不确认位置停止。      04/04/22
	CO3_LUBC, 			// 2  0x0004 1: 润滑油位检测反逻辑 0=ERROR，1=OK。	
	CO3_SDRP, 			// 3  0x0008 1: 自动安全门关遇到保护使作开门动作。06-12-30
	CO3_MAIR, 			// 4  0x0010 1: 手动时开模输出吹气。        07-6-8
	CO3_NFOF, 			// 5  0x0020 1: 自动射出完关闭座进阀。      04-02-29
	CO3_STEN, 			// 6  0x0040 1: 储能时不开比例阀。          04-11-18
	CO3_SDAM, 			// 7  0x0080 1: 脱模后安全门未开警报        06-8-24         
	CO3_BAKE, 			// 8  0x0100 1: 可使用排气功能。      		07-7-27
	CO3_HYPD, 			// 9  0x0200 1: 使用油压安全门。  			06-12-02
	CO3_WSTO, 			// 10 0x0400 1: 动作启动段使用   			20160628
	CO3_PWRM, 			// 11 0x0800 1: 配阀功能不使用				20191209HH
	CO3_AIRM, 			// 12 0x1000 1: 手动吹气使用模式控制。    	07-01-29
	CO3_TSTO, 			// 13 0x2000 1: 电子尺均值滤波功能 			20190627
	CO3_TNOZ, 			// 14 0x4000 1: 座台使用时间。        		04-12-27
	CO3_EJTNEW, 		// 15 0x8000 1: 开机后ECAT连接采取旧方案(不接驱动时旧方案60s，新方案18s) 2022-5-6 ccz

//   CONFIG 4:     @44H (CODE:@88-0000)
	CO4_USSS=64,		// 0  0x0001 1: 美规安全门动作。安全门开切到手动 06-12-21
	CO4_SAF2, 			// 1  0x0002 1: 储料电流监控
	CO4_SRAU, 			// 2  0x0004 1: 开马达前检测油温   20160816
	CO4_QDC, 			// 3  0x0008 1: (*?)QDC 功能使用		
	CO4_MOTOR, 			// 4  0x0010 1: (*?)检测电机温度且电机温度是最后一段。   09-03-11
	CO4_MEJT, 			// 5  0x0020 1: 特殊中子1中子进移到关模前
	CO4_MOTR, 			// 6  0x0040 1: 马达开输出点保持常开。 
	CO4_PWDR, 			// 7  0x0080 1: 使用自动安全门。      06-11-01
	CO4_CACE, 			// 8  0x0100 1: 座台进须确认关模终。  06-12-21
	CO4_INOF, 			// 9  0x0200 1: 射出完先切压力比例 (RAMP DOWN AIBFTD)，再切流量比例，而後关阀。06-10-25		 
	CO4_NCKY, 			//10  0x0400 1: 关摸高压使用两个小数点
	CO4_CKEY, 			//11  0x0800 1: 动作运行前启动键。	07-4-16
	CO4_APHP, 			//12  0x1000 1: 射出保压时，背压通道口输出最大值
	CO4_APUG, 			//13  0x2000 1: 调模开关模执行标准途中中子，连动中子
	CO4_INPG, 			//14  0x4000 1: 座进前先做射出清料动作。  07-7-9
	CO4_ISOF, 			//15  0x8000 1: 半自动每模运行键

//   CONFIG 5:      @45H (CODE:@8A-0000)
	CO5_INJET=80,			//0   0x0001 1: 注射时间上传  2010-09-06	
	CO5_INGEJT, 			// 1  0x0002 1: 自动模式下压料缸动作按键无效(lzh 2022.1.4)
	CO5_SAFEDR, 			// 2  0x0004 1: 脱模时不检测安全门
	CO5_DORMEC, 			// 3  0x0008 1: 机械安全检知,作为下一循环判断条件
	CO5_CORE, 				// 4  0x0010 1: (*?)没在使用
	CO5_SERVOERR,			// 5  0x0020 1: (*?)伺服故障报警功能
	CO5_LUBBFCLS, 			// 6  0x0040 1: 如果上次润滑失败，在自动前重新检测润滑
	CO5_INJCHADA,			// 7  0x0080 1: 动作开环(射出、保压、储料、托模)
	CO5_INJFLACC,			// 8  0x0100 1: 射出流量一位小数
    CO5_ADJMOLD,			// 9  0x0200 1: 松模问题的自动调模
    CO5_YXBIG,		        // 10 0x0400 1: 阳鑫大机，背压阀、泄压阀、背压的输出时间点不一样
    CO5_SAFEDRCTL,			// 11 0x0800 1: 门机控制器故障报警时关马达
    CO5_BAPRSACC,			// 12 0x1000 1: 背压压力一位小数点
    CO5_LUBERTWI,			// 13 0x2000 1: 润滑检知连续出错两次再报警
    CO5_SDRVALVE,			// 14 0x4000 1: 安全阀检测功能
    CO5_REMOVE_NEWHYDR,     // 15 0x8000 1:	光塑580模拟量转速显示
    
//   CONFIG 43:       (CODE:@D6-0000)
	CO43_EJEPRE=96,			// 0  0x0001  1: (*?)伺服机，脱模时，有允许超压压力和最低流量		10-04-27
	CO43_CHARGE, 			// 1  0x0002  1: 储料时开射出阀	恩格				10-04-27
	CO43_INJPRE, 			// 2  0x0004  1: 默认主机在面板请求完CODE码后再向面板请求数据，打上后恢复为原来的主机和面板独立请求 2025-3-4 ccz
	CO43_INJHOD, 			// 3  0x0008  1: 残料位置取注射保压最小位置			10-09-23
	CO43_CHAEJT, 			// 4  0x0010  1: 接收面板发送的手动键值，并切手动   20171222
	CO43_ROTLAC, 			// 5  0x0020  1: 使用转模功能。   10-7-29
	CO43_BLAST, 			// 6  0x0040  1: 射出顺序阀使用
	CO43_PfRamp, 			// 7  0x0080  1: 斜率走老系统模式     2015-9-2
	CO43_POWERCAN,			// 8  0x0100  1: 能耗表数据通过can获得
	CO43_IINJ,				// 9  0x0200  1: 进料口切断新逻辑(lzh 2021.12.20)
 	CO43_MODE5CLS,			// 10 0x0400  1: (*?)5模式下关模平稳功能
  	CO43_CAN2EXT,			// 11 0x0800  1: 扩展板使用CAN2
 	CO43_RSV1,              // 12 0x1000  1: 10倍输入点滤波
	CO43_RSV,	            // 13 0x2000  1: 注射转保压时间模式时,位置到也转保压
	CO43_UTVLV, 			// 14 0x4000  1: 关模快速时，在差动和低压时开差动阀
	CO43_FASTCL, 			// 15 0x8000  1: 关模快速开至低压

//   code 16:     (CODE:@D8-0000)
/**************************************************************************
1.驱动器的控制模式配置：CO32_DRVEXE
2.动作的配置：CO32_PUMPS，CO32_SERSORS，CO32_ACTSMU
	单泵，（单传感器，单动作 ）： 0
	多泵，  单传感器，单动作   ： 0x0002
	多泵，  多传感器，单动作   ：, 			|, 			= 0x0006
	多泵，  多传感器，多动作   ：, 			|, 			|, 			= 0x000E
**************************************************************************/
	CO32_DRVEXE=112,		// 0  0x0001	 没在使用
	CO32_PUMPS,				// 1  0x0002	 没在使用																		
	CO32_SERSORS,			// 2  0x0004	 没在使用
	CO32_ACTSMU,			// 3  0x0008	 没在使用																																		
	CO32_NOSEND,			// 4  0x0010	 没在使用
	CO32_CORESAME,			// 5  0x0020	 没在使用
	CO32_RSV,               // 6  0x0040      没在使用	
	
//   code  48 : INTERNAL  CONFIG FLAG (CODE:@E0-0000)
	XF0_PRESDIS=128,	// 0  0x0001 1: (*?)显示警报“压力未小于5公斤，无法切成主机”
	XF0_EJTTM, 			// 1  0x0002 1: 脱模使用时间。    04-03-27
	XF0_SAFED, 			// 2  0x0004 1: 特殊安全阀输出   yxh
	XF0_MLATX, 			// 3  0x0008 1: 安全门检测时间固定为50ms，同时面板灰掉  20160512
	XF0_CPRNH, 			// 4  0x0010 1: 机械手急停反逻辑
	XF0_RELBP, 			// 5  0x0020 1: 半自动首次脱进不检查安全门     QRC 16.3.24	
	XF0_UTVLV, 			// 6  0x0040 1: 使用差装阀逻辑。     04-
	XF0_CLSEB, 			// 7  0x0080 1: 为了兼容老面板，打上代码时，去除射出模式选择时间/位置时，转保压位置依旧有效的功能  20170606
	XF0_AUTOARMOD,      // 8  0x0100 1: 自动警报使用老系统模式   20160829
	XF0_ADJLU, 			// 9  0x0200 1: 自动警报重新开始不强制过滤三模   20161021   
	XF0_RELSP, 			// 10 0x0400 1: (*?)泄压时，输出比例阀。         03/03/27
	XF0_EJTHOLD,        // 11 0x0800 1: 顶进保持功能
	XF0_ACCFL, 			// 12 0x1000 1: 使用E502扩展版（IV3100）
	XF0_SYSACC, 		// 13 0x2000 1: 使用系统蓄能                 05-8-20 浮动缸
	XF0_BACRL, 			// 14 0x4000 1: 使用最小开模时间保护机械手//不使用开模结束后 的50ms电子尺滤波功能20200221
	XF0_REMERG, 		// 15 0x8000 1: 紧急停止反逻辑。    04

//   code  49:      INTERNAL CONFIG FLAG (CODE:@E2-0000)
	XF1_HTMT=144,		// 0  0x0001 1: 使用外部使能
	XF1_EJTNH, 			// 1  0x0002 1: AI开模算法40mm间隔
	XF1_NOBCK, 			// 2  0x0004 1: 动作缓存在下个循环时生效
	XF1_CHRCP, 			// 3  0x0008 1: 普通机模式时马达采用星三角启动方式 2023-8-29 ccz
	XF1_MLTHYD, 		// 4  0x0010 1: (*?)开模上升时间斜率，下降位置斜率  20160531
	XF1_CLPZE, 			// 5  0x0020 1: 自动调模开模100mm
	XF1_HTMHYD, 		// 6  0x0040 1: 海太双油路。                 07-07-06 
	XF1_INJST, 			// 7  0x0080 1: 射出储能，使用压力传感器。   06-9-11 
	XF1_SOSLT, 			// 8  0x0100 1: (*?)开模位置斜率算法
	XF1_SOSLS, 			// 9  0x0200 1: 安全门慢速阀使用时间切。08-5-8
	XF1_NMV, 			// 10 0x0400 1: 耐训二油路阀输出        20150804
	XF1_HTDHP, 			// 11 0x0800 1: (*?)温度缓冲区不使用自学习值，由客户自行手动设置 
	XF1_CPRS4, 			// 12 0x1000 1: (*?)开模位置斜率算法，使用开模减速时间 20160607  yxh  
	XF1_CHRLT, 			// 13 0x2000 1: 不使用开关模手动放开平滑功能
	XF1_SORCP, 			// 14 0x4000 1: 关闭物料满判定在再循环前
	XF1_ROBD, 			// 15 0x8000 1: 关模不使用算法
	

//   code  50:      INTERNAL CONFIG FLAG (CODE:@E4-0000)
	XF2_RELOP = 160,	// 0  0x0001 1: 面板使用，主要用于通用韩国机，用于区分射出监控正负号显示  20161010   yxh
	XF2_ADLRV, 			// 1  0x0002 1: 自动警报按手动键清除，并重新计算   20161010   yxh
	XF2_CPRBA, 			// 2  0x0004 1: 手动调模进退，自动调模检测脱模，中子    20160510  yxh
	XF2_SDRTF, 			// 3  0x0008 1: 打上代码，关闭室温芯片断电复位功能  20220706 yxh
	XF2_ROPNM, 			// 4  0x0010 1: 手动状态下，上一个动作的阀未完全关闭的状态，不允许做其他动作  20160425 yxh  
	XF2_SLBHI, 			// 5  0x0020 1: 手动射出使用调模压力流量参数开放  20170724    (用于开放面板参数)
	XF2_RSNOM, 			// 6  0x0040 1: 自动停留超30s切手动功能，打上代码后屏蔽，不会切手动  20201112
	XF2_SOECH, 			// 7  0x0080 1: 开环走储料背压通道   20160612
	XF2_COFST, 			// 8  0x0100 1: 开模减速使用大斜坡
	XF2_RELCL, 			// 9  0x0200 1: 料筒等比例加温时显示温度   2016-04-18  yxh
	XF2_INSH2, 			// 10 0x0400 1: (*?)开模前检测到料位已满，继续开模
	XF2_SUCWO,			// 12 0x0800 1: 中子使用优先级功能
	XF2_OPNBK, 			// 12 0x1000 1: 自动托模检测安全门，手动托模不检测安全门
	XF2_DPUMP, 			// 13 0x2000 1: 甬江机器，关模位置吹气时，打开后直接在射出保压结束关闭
	XF2_AICLAMP, 		// 14 0x4000 1: 开模AI记忆
	XF2_SUCKM, 			// 15 0x8000 1: 关模减速使用大斜坡

//   code  51:      INTERNAL CONFIG FLAG (CODE:@E6-0000)
	XF3_CPRSP = 176,	// 0  0x0001 1: 更改动作方式在下一模生效   yxh	  	20160111
	XF3_CPRSS, 			// 1  0x0002 1: (*?)动作步骤面板实时显示     		20160629    yxh
	XF3_COLOF, 			// 2  0x0004 1: 关模任意段开始，都开0.5s脱退阀     	2017-04-19 QRC
	XF3_EJTVB, 			// 3  0x0008 1: 关模时开脱退阀，不用脱膜次数打0    	2017-04-19 QRC
	XF3_RSDFM, 			// 4  0x0010 1: 後安全门开, 开关模时切马达。       	03/03/19
	XF3_RSDMA, 			// 5  0x0020 1: 後安全门开, 不切马达, 但转手动。   	03/03/19
	XF3_MSTOR, 			// 6  0x0040 1: 射出开环高低流量校正功能           	2017-04-19 QRC
	XF3_SPSTO, 			// 7  0x0080 1: 全自动可以脱模停留功能  			20161109   
	XF3_YWSTO, 			// 8  0x0100 1: 通讯模式下同步输出模拟量         	2017-04-19 QRC
	XF3_LHACC, 			// 9  0x0200 1: 关模异常导致的异常开模不做吹气动作 	2017-04-26 QRC
	XF3_SHFST, 			// 10 0x0400 1: 声海快速机。                       	07-5-29
	XF3_HS7HT, 			// 11 0x0800 1: 开模时检测检出电眼                 	2017-04-26 QRC
	XF3_SHUT2, 			// 12 0x1000 1: 关摸前检测安全门故障    			20160519
	XF3_CLSLL, 			// 13 0x2000 1: 关摸低压计时实时显示\关模低压使用计时上限   			20180102
	XF3_ADFRS, 			// 14 0x4000 1: 电眼信号首次无效，再做一次脱模，再次检测电眼信号
	XF3_EUROB, 			// 15 0x8000 1: 安全阀输出反逻辑

//   code 52:      INTERNAL CONFIG FLAG (CODE:@E8-0000)
	XF4_OILT = 192,		// 0  0x0001  1: (*?)再循环时间，冷却计时，储前冷却时间两位小数		
	XF4_INJSV, 			// 1  0x0002  1: 全自动托模停留，托模退在机械手完成后执行
	XF4_OILVL, 			// 2  0x0004  1: 储料不开座进阀
	XF4_ISTOR, 			// 3  0x0008  1: (*?)没在使用
	XF4_OPNRL, 			// 4  0x0010  1: 机械手过程中不检测开合模位置
	XF4_OLNOM, 			// 5  0x0020  1: 面板使用，无推力座时，印度客户Ton与高压压力的转化   给面板使用 20180423
	XF4_SAFA, 			// 6  0x0040  1: (*?)没在使用
	XF4_SAVC2, 			// 7  0x0080  1: 使用可变状态栏
	XF4_AACNT, 			// 8  0x0100  1: 数据监控功能使用      预留给面板使用  主机不可占用  20170704
	XF4_SANOM, 			// 9  0x0200  1: 驱动器欠压故障屏蔽   预留给面板使用 主机不可占用  20171113
	XF4_MIST, 			// 10 0x0400  1: 定次时，托模进后保持功能
	XF4_OHNOM, 			// 11 0x0800  1: 开环动作时,其他动作模拟量输出0
	XF4_TMPLIMIT, 		// 12 0x1000  1: 不使用温度实时监测超过设定度数报警功能     
	XF4_AAOE, 			// 13 0x2000  1: AO4通道走AO3输出,AO4不输出
	XF4_BAKNF, 			// 14 0x4000  1: 开模时光幕检测
	XF4_CPRSN, 			// 15 0x8000  1: 托模时光幕检测
	
//    code 53:      INTERNAL CONFIG FLAG (CODE:@EA-0000)
	XF5_A500CHR = 208,	// 0 0x0001 1: 一慢关闭快速阀
	XF5_LUBJM, 			// 1 0x0002 1: (*?)没在使用
	XF5_SBTPUMPS,   	// 2 0x0004 1: 托模前不检测托模退是否到位，可以直接托模进  20180521
	XF5_SFSENCTL,		// 3 0x0008 1: 不使用警报详细信息上传(不翻译，如果外面使用出问题时用。以后如果一直都没问题，则去掉该代码)
	XF5_PUMP1,			// 4 0x0010 1: 伺服泄压反逻辑											
	XF5_INJTM,          // 5 0x0020 1: 调模使用时，中子不受电子尺和限位开关限制  20220915 ccz
	XF5_RSV,	        // 6 0x0040 1: 调模使用时，射退不受电子尺和限位开关限制   20171222
	XF5_CLAMPCLS,		// 7 0x0080 1: 调模使用时，开关模不受电子尺和限位开关限制  20171222
	XF5_INJMUTL,   		// 8 0x0100 1: 调模使用时，储料不受电子尺和限位开关限制   20171222
	XF5_EJENCTL,   		// 9 0x0200 1: 调模使用时，托模不受电子尺和限位开关限制  10-03-03
	XF5_INJBCHR,   		//10 0x0400 1: 注射前储料：关模后->挡板进->储料->挡板退->射出->开模。 必须同时使用CO4_ISOF, 			//15  1: 喷嘴截流(SHUT OFF)动作   09-12-17
	XF5_LUBEMRG,   		//11 0x0800 1: 润滑检知失败切电机，同reset。   09-10-19
	XF5_SAFEH2, 		//12 0x1000 1: 安全门使用第二油路。   08-9-25
	XF5_TSENS, 			//13 0x2000 1: (*?)电眼使用时间检测。     08-1-10
	XF5_DHMAN, 			//14 0x4000 1: 实时上传警报状态
	XF5_MSENS, 			//15 0x8000 1: 使用多电眼。     07-12-20

//   code  54:     INTERNAL CONFIG FLAG (CODE:@EC-0000)
	XF6_EFFC = 224, 	// 0  0x0001  1: 开马达初始化Ecat(关马达断强电)
	XF6_CREJT, 			// 1  0x0002  1: 托模前不检测中子退终   2021-6-17 ccz
	XF6_CHKMR, 		    // 2  0x0004  1: 检出电眼反逻辑。 
	XF6_INJCLS, 		// 3  0x0008  1: 射出时开关模阀(自动)。 06-2-17
	XF6_EJTCR, 		    // 4  0x0010  1: 中子进前不检测托退终  2021-6-17 ccz
	XF6_HSERV0, 		// 5  0x0020  1: 使用伺服驱动。   07-4-20								
	XF6_CRSEQ, 			// 6  0x0040  1: 使用中子顺序检查功能   2021-6-17 ccz
	XF6_INJDBL, 		// 7  0x0080  1: 可使用二次射出。 07-10-11
	XF6_HTPRER, 		// 8  0x0100  1: (*?)使用预泄压。     07-11-19
	XF6_EXTIO, 			// 9  0x0200  1: 使用扩展IO。     07-12-19
	XF6_EXTTEMP, 		// 10 0x0400  1: (*?)使用扩展温度。   07-12-19
	XF6_EXTDA, 			// 11 0x0800  1: 使用扩展ADDA。   07-12-19
	XF6_CANSRV, 		// 12 0x1000  1: 使用CAN SERVO。   08-3-24
	XF6_EXTIO2, 		// 13 0x2000  1: 使用第二块扩展IO。2015.08.07
	XF6_EXTE301IO, 		// 14 0x4000  1: (*?)使用使用E301 IO 扩展功能
	XF6_EXT301TEMP, 	// 15 0x8000  1: (*?)使用E301温度扩展功能
	
//    油路控制 :        @48H (CODE:@90-0000)
	CO8_YL1 = 240,      // 0 0x0001 1: 泄压速度可以设定10%以下  
	CO8_YL2,            // 1 0x0002 1: (*?)没在使用   
	CO8_YL3,            // 2 0x0004 1: 定位算法使用电子尺速度计算  
	CO8_YL4,            // 3 0x0008 1: DA线性调整使用0-10.000V的方式   
	CO8_LINE,           // 4 0x0010 1: 面板DA是否底流
	CO8_ALONPID,        // 5 0x0020 1: (*?)老模式时的广播
	C08_MCHAR,			// 6 0x0040 1: 关闭自动恢复使能功能
	C08_MEJEC, 			// 7 0x0080 1: 油路传感器类型独立
	C08_MCORE, 			// 8 0x0100 1: 伺服PI值固定发210和10 2023-5-23 ccz
	C08_MANUAL, 		// 9 0x0200 1: 手动状态能做同时动作   09-11-20										
	C08_MSAME, 			//10 0x0400 1: (*?)使用多伺服大机功能并且使用同时动作   09-10-07
	C08_MSERVO, 		//11 0x0800 1: (*?)使用多伺服大机功能   09-07-01
	C08_NEWHYD, 		//12 0x1000 1: 从泵独立泄压
	CO8_OILVLV, 		//13 0x2000 1: (*?)伺服系统使用比例阀
	CO8_FLPMP, 			//14 0x4000 1: ek大于0时才能重算积分 2022-6-28 ccz
	CO8_FLLMT, 			//15 0x8000 1: 使用配置编码对接驱动器
	
//   温度控制:        @49H (CODE:@92-0000)
	CO9_HSEL = 256,		// 0  0x0001  0: (*?)使用标准加热     1: 使用渐近加热  06-9-25
	CO9_TKTJ, 			// 1  0x0002  0: 感温线使用'K'TYPE  1: 感温线使用'J'
	CO9_DCDF, 			// 2  0x0004  1: 油温使用板载室温
	CO9_TEMPMTI, 		// 3  0x0008  1: (*?)使用分段积分模式(包含自学习)
	CO9_XIND, 			// 4  0x0010  1: IV3100A最后一段料筒温度做外部室温补偿
	CO9_HIGH, 			// 5  0x0020  0: 温度归零/校准值使用出厂调试区数据 2023-9-19 ccz
	CO9_PIDS, 			// 6  0x0040  0: (*?)没在使用
	CO9_RSV1, 			// 7  0x0080  0: (*?)没在使用
	CO9_FAST, 			// 8  0x0100  1: (*?)没在使用
	CO9_RSV2, 			// 9  0x0200  0: (*?)没在使用
	CO9_TIP, 			// 10 0x0400  1: 每次加热都学习PID
	CO9_RSV3, 			// 11 0x0800  1: 关闭PID自学习及缓冲区自学习功能
	CO9_Z4_5, 			// 12 0x1000  1: (*?)没在使用
	CO9_FUZZY, 			// 13 0x2000  1: 开启超温抑制功能
    CO9_HSNEW,			// 14 0x4000  0: (*?)使用标准加热     1: 使用渐近加热  06-9-25
    CO9_TEMPMD,			// 15 0x8000  0: (*?)普通模式     1: 快速机模式  06-9-25
    
//   电子尺控制  :     @4AH (CODE:@94-0000)
	COA_SENSOR = 272, 	// 0  0x0001 (*?)0: 1-5V  1:0-10V;
	COA_SENSOR2, 		// 1  0x0002 (*?)0: 1-5V  1:0-10V;
	COA_CHL4N, 			// 2  0x0004 座台使用电子尺  07-01-18
	COA_ERTYPE,			// 3  0x0008 (*?)0:没在使用
	
	COA_CHL3, 			// 4  0x0010 (*?)CHL 4 0010:INJECT PRES, 
	COA_CHL4C, 			// 5  0x0020 关闭开合模电子尺断开保护的报警提醒(仅保护)。
	COA_CHL4, 			// 6  0x0040 关闭开合模电子尺断开保护功能

	COA_CHL5, 			// 7  0x0080 CHL 4 AS INJ ACC PRES   05-9-29
	COA_CHL3S, 			// 8  0x0100 (*?)CHL 3 AS #2(INJ2(BIT5-4=1)/EJT2(BIT5-4=2)/NOZ2(BIT5-4=3))				没在使用
	COA_CHL4S, 			// 9  0x0200 (*?)CHL 4 AS #2(INJ2(BIT7-6=1)/EJT2(BIT7-6=2)/NOZ2(BIT7-6=3))				没在使用
	COA_CHL5S, 			// 10 0x0400 (*?)CHL 5 AS #2(INJ2(BIT9-8=1)/EJT2(BIT9-8=2)/NOZ2(BIT9-8=3))				没在使用
	COA_INF_OFF,		// 11 0x0800 (*?)射出时不开座进阀  dw 09/03/30											没在使用
	COA_REV , 			// 12 0x1000 (*?)没在使用

//  国标安全代码
    CO11_SAFENOZZLE = 304,    //0x0001 	座台检测安全门 1                 
    CO11_SAFEEJT,             //0x0002 	脱模检测安全门 1
    CO11_SAFECLMPOPN,         //0x0004 	开模检测安全门 1
    CO11_SAFECORE,            //0x0008 	中子检测安全门 1
    CO11_SAFECHG,             //0x0010 	储料检测安全门 1
    CO11_SAFEINJ,             //0x0020 	射出检测安全门 1
    CO11_CHGPUA,              //0x0040 	储料检测射出防护罩 1
    CO11_NOZPUA,              //0x0080 	座台检测射出防护罩 1
    CO11_NULL,            	  //0x0100     没在使用
    CO11_ADJSTTUA,            //0x0200 	调模退检测安全门
    CO11_SAFEEJTB,            //0x0400 	托模退检测安全门 1
  }MACHINE_CONF_CODE;

#endif
